{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "962e51ce",
   "metadata": {},
   "source": [
    "# Mini-Projeto 3: Ontologia de Hollow Knight (Sistemas Baseados em Conhecimento)\n",
    "\n",
    "## Equipe\n",
    "\n",
    "| #   | Nome completo             | Matrícula       |\n",
    "| --- | ------------------------- | --------------- |\n",
    "| 1   | *João Victor Oliveira*    | *(20240008468)* |\n",
    "| 2   | *Kevin Gabriel Mangueira* | *(20240008000)* |\n",
    "| 3   | *Luiz Henrique Santos*    | *(20240008261)* |\n",
    "| 4   | *Victor Gabriel Menezes*  | *(20240008323)* |\n",
    "\n",
    "## Resumo da Base\n",
    "Este projeto consiste na modelagem de um Grafo de Conhecimento baseado no universo do jogo Hollow Knight. A base foi construída utilizando as linguagens RDF, RDFS e OWL, e estruturada no formato Turtle (`.ttl`). O objetivo da ontologia é mapear as complexas relações do jogo, interligando os personagens, as localidades que habitam, os itens que comercializam e as habilidades que o jogador pode adquirir.\n",
    "\n",
    "## Principais Entidades e Classes\n",
    "* **Entidade:** A classe raiz que engloba tudo no universo mapeado.\n",
    "* **Personagem:** Subdividido para representar os diferentes tipos de seres encontrados.\n",
    "* **Localidade:** Representa o mapa do jogo, desde grandes áreas até salas específicas.\n",
    "* **Item:** Engloba tudo que pode ser coletado, equipado ou comprado.\n",
    "* **Boss (Chefão):** Entidades de alto nível de combate.\n",
    "* **Amuleto:** Itens que consomem espaços e concedem vantagens.\n",
    "\n",
    "## Explicação Básica da Taxonomia (Hierarquia)\n",
    "A taxonomia foi desenhada com dois níveis principais abaixo da raiz (`hk:Entidade`), garantindo a organização hierárquica exigida. A classe `hk:Personagem` ramifica-se em `hk:Boss`, `hk:NPC` e `hk:InimigoComum`. A classe `hk:Localidade` divide-se em `hk:Regiao` (áreas amplas como Hallownest e Dirtmouth) e `hk:SubRegiao` (áreas menores contidas nas regiões maiores). Por fim, a classe `hk:Item` ramifica-se em `hk:Amuleto`, `hk:Habilidade` e `hk:Equipamento`. Classes disjuntas foram aplicadas para garantir que, por exemplo, um personagem não possa ser classificado como um mapa ou um item.\n",
    "\n",
    "## Instruções de Execução\n",
    "\n",
    "**Pré-requisitos:**\n",
    "* Python 3.x instalado.\n",
    "* Biblioteca `rdflib` instalada.\n",
    "\n",
    "**Passo a passo:**\n",
    "1. Clone este repositório em sua máquina local.\n",
    "2. Abra o terminal na pasta do projeto.\n",
    "3. Instale a dependência necessária executando o comando: `pip install rdflib`\n",
    "4. Execute a aplicação principal com o comando: `python consultas.py` (ou execute as células caso esteja usando um Jupyter Notebook `consultas.ipynb`).\n",
    "5. A aplicação carregará o arquivo `hollow_knight_ontologia.ttl` e imprimirá automaticamente no terminal os resultados das 5 consultas `g.triples()` e das 8 consultas SPARQL, detalhando o propósito de cada uma."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "eaccf9ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Grafo carregado com sucesso!\n"
     ]
    }
   ],
   "source": [
    "# Importa as bibliotecas necessárias\n",
    "from rdflib import Graph, Namespace, URIRef, Literal\n",
    "from rdflib.namespace import RDF, RDFS, OWL\n",
    "\n",
    "# Carregar o grafo\n",
    "g = Graph()\n",
    "g.parse(\"hollow_knight_ontologia.ttl\", format=\"turtle\")\n",
    "\n",
    "HK = Namespace(\"http://example.org/hollowknight#\")\n",
    "\n",
    "print(\"Grafo carregado com sucesso!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f39d4438",
   "metadata": {},
   "source": [
    "## Predicados"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "b71be696",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "1. Tudo sobre The Knight:\n",
      "  - type -> Personagem\n",
      "  - nome -> The Knight\n"
     ]
    }
   ],
   "source": [
    "# 1. Sujeito Fixo: Encontrar todas as propriedades e objetos para 'Elderbug'\n",
    "print(\"\\n1. Tudo sobre The Knight:\")\n",
    "for s, p, o in g.triples((HK.TheKnight, None, None)):\n",
    "    print(f\"  - {p.split('#')[-1]} -> {o.split('#')[-1] if '#' in o else o}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b71be8e2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "2. Todos os Bosses:\n",
      "  - FalseKnight\n",
      "  - GruzMother\n",
      "  - BroodingMawlek\n",
      "  - HornetProtector\n",
      "  - MassiveMossCharger\n",
      "  - MantisLords\n",
      "  - SoulMaster\n",
      "  - DungDefender\n",
      "  - Flukemarm\n",
      "  - CrystalGuardian\n",
      "  - BrokenVessel\n",
      "  - Nosk\n",
      "  - Uumuu\n",
      "  - HiveKnight\n",
      "  - WatcherKnights\n",
      "  - TheCollector\n",
      "  - TraitorLord\n",
      "  - HornetSentinel\n",
      "  - TheHollowKnight\n",
      "  - TheRadiance\n",
      "  - TroupeMasterGrimm\n",
      "  - NightmareKing\n",
      "  - PureVessel\n",
      "  - GreyPrinceZote\n",
      "  - SistersOfBattle\n",
      "  - AbsoluteRadiance\n"
     ]
    }
   ],
   "source": [
    "# 2. Predicado Fixo: Encontrar todas as entidades que são Bosses (Chefões)\n",
    "print(\"\\n2. Todos os Bosses:\")\n",
    "for s, p, o in g.triples((None, RDF.type, HK.Boss)):\n",
    "    print(f\"  - {s.split('#')[-1]}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "1bf42489",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "3. Vivem em Dirthmouth:\n",
      "  - Elderbug\n",
      "  - Sly\n",
      "  - Iselda\n",
      "  - Bretta\n",
      "  - GrimmTroupeMaster\n",
      "  - TroupeMasterGrimm\n",
      "  - NightmareKing\n"
     ]
    }
   ],
   "source": [
    "# 3. Objeto Fixo: Encontrar quem vive em 'Forgotten Crossroads'\n",
    "print(\"\\n3. Vivem em Dirthmouth:\")\n",
    "for s, p, o in g.triples((None, HK.habitaEm, HK.Dirtmouth)):\n",
    "    print(f\"  - {s.split('#')[-1]}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "cc265ae6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "4. O que a Iselda vende:\n",
      "  - WaywardCompass\n",
      "  - SimpleKey\n"
     ]
    }
   ],
   "source": [
    "# 4. Sujeito e Predicado Fixos: Encontrar o que a Iselda vende\n",
    "print(\"\\n4. O que a Iselda vende:\")\n",
    "for s, p, o in g.triples((HK.Iselda, HK.vende, None)):\n",
    "    print(f\"  - {o.split('#')[-1]}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3836f004",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "5. Amuletos que custam 220 Geo:\n",
      "  - WaywardCompass\n",
      "  - ShamanStone\n"
     ]
    }
   ],
   "source": [
    "# 5. Predicado e Objeto Fixos: Encontrar amuletos que custam 220 Geo\n",
    "print(\"\\n5. Amuletos que custam 220 Geo:\")\n",
    "for s, p, o in g.triples((None, HK.custoGeo, Literal(220))):\n",
    "    print(f\"  - {s.split('#')[-1]}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "292cf22e",
   "metadata": {},
   "source": [
    "# Consultas em SPARQL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d158c052",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "1. SPARQL SELECT (Filter): Amuletos > 250 Geo\n",
      "  - Gathering Swarm custa 300\n",
      "  - Fragile Heart custa 350\n",
      "  - Fragile Strength custa 600\n",
      "  - Unbreakable Heart custa 900\n",
      "  - Unbreakable Greed custa 900\n",
      "  - Unbreakable Strength custa 900\n",
      "  - Heavy Blow custa 350\n",
      "  - Longnail custa 300\n",
      "  - Quick Focus custa 800\n"
     ]
    }
   ],
   "source": [
    "# 1. SELECT com FILTER: Encontrar itens que custam mais de 200 Geo\n",
    "q1 = \"\"\"\n",
    "SELECT ?nome ?custo WHERE {\n",
    "    ?item rdf:type hk:Amuleto .\n",
    "    ?item hk:nome ?nome .\n",
    "    ?item hk:custoGeo ?custo .\n",
    "    FILTER(?custo > 250)\n",
    "}\n",
    "\"\"\"\n",
    "print(\"\\n1. SPARQL SELECT (Filter): Amuletos > 250 Geo\")\n",
    "for row in g.query(q1):\n",
    "    print(f\"  - {row.nome} custa {row.custo}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "2. SPARQL SELECT (Order By): Personagens em ordem alfabética\n",
      "  - Absolute Radiance\n",
      "  - Aspid Hunter\n",
      "  - Bardoon\n",
      "  - Bretta\n",
      "  - Broken Vessel\n",
      "  - Brooding Mawlek\n",
      "  - Charm Lover Salubra\n",
      "  - Cloth\n",
      "  - Cornifer\n",
      "  - Crawlid\n",
      "  - Crystal Guardian\n",
      "  - Divine\n",
      "  - Dung Defender\n",
      "  - Elderbug\n",
      "  - False Knight\n",
      "  - Flukemarm\n",
      "  - Garden Ghoul\n",
      "  - Great Nailsage Sly\n",
      "  - Grey Prince Zote\n",
      "  - Grubfather\n",
      "  - Gruz Mother\n",
      "  - Hive Knight\n",
      "  - Hornet Protector\n",
      "  - Hornet Sentinel\n",
      "  - Husk Guard\n",
      "  - Iselda\n",
      "  - Jiji\n",
      "  - Leg Eater\n",
      "  - Little Fool\n",
      "  - Mantis Lords\n",
      "  - Markoth\n",
      "  - Marmu\n",
      "  - Mask Maker\n",
      "  - Massive Moss Charger\n",
      "  - Midwife\n",
      "  - Millibelle the Banker\n",
      "  - Mistaken Vessel\n",
      "  - Moss Knight\n",
      "  - Nailsmith\n",
      "  - Nightmare King Grimm\n",
      "  - Nosk\n",
      "  - Quirrel\n",
      "  - Relic Seeker Lemm\n",
      "  - Seer\n",
      "  - Shrumal Ogre\n",
      "  - Sisters of Battle\n",
      "  - Sly\n",
      "  - Soul Master\n",
      "  - The Collector\n",
      "  - The Hollow Knight\n",
      "  - The Knight\n",
      "  - The Pale King\n",
      "  - The Pure Vessel\n",
      "  - The Radiance\n",
      "  - The White Lady\n",
      "  - Tiso\n",
      "  - Traitor Lord\n",
      "  - Troupe Master Grimm\n",
      "  - Troupe Master Grimm (NPC)\n",
      "  - Uumuu\n",
      "  - Vengefly\n",
      "  - Vengefly King\n",
      "  - Watcher Knights\n",
      "  - Zombie Miner\n",
      "  - Zote the Mighty\n"
     ]
    }
   ],
   "source": [
    "# 2. SELECT com ORDER BY: Ordenar personagens por nome\n",
    "q2 = \"\"\"\n",
    "SELECT ?nome WHERE {\n",
    "    ?char rdf:type/rdfs:subClassOf* hk:Personagem .\n",
    "    ?char hk:nome ?nome .\n",
    "} ORDER BY ASC(?nome)\n",
    "\"\"\"\n",
    "print(\"\\n2. SPARQL SELECT (Order By): Personagens em ordem alfabética\")\n",
    "for row in g.query(q2):\n",
    "    print(f\"  - {row.nome}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "3. SPARQL ASK: A Hornet vive em Dirtmouth?\n",
      "  - Resultado: False\n"
     ]
    }
   ],
   "source": [
    "# 3. ASK: A Hornet vive em Greenpath?\n",
    "q3 = \"\"\"\n",
    "ASK { hk:Hornet hk:habitaEm hk:Dirtmouth . }\n",
    "\"\"\"\n",
    "print(\"\\n3. SPARQL ASK: A Hornet vive em Dirtmouth?\")\n",
    "for row in g.query(q3):\n",
    "    print(f\"  - Resultado: {row}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "4. SPARQL CONSTRUCT: Sub-grafo de mercadores criado. (ordenado)\n",
      "  - Grubfather vende GatheringSwarm       \n",
      "  - Iselda     vende WaywardCompass       \n",
      "  - Iselda     vende SimpleKey            \n",
      "  - LegEater   vende FragileStrength      \n",
      "  - LegEater   vende UnbreakableStrength  \n",
      "  - LegEater   vende FragileHeart         \n",
      "  - LegEater   vende UnbreakableHeart     \n",
      "  - LegEater   vende FragileGreed         \n",
      "  - LegEater   vende UnbreakableGreed     \n",
      "  - Lemm       vende KingsIdol            \n",
      "  - Lemm       vende ArcaneEgg            \n",
      "  - Lemm       vende WanderersJournal     \n",
      "  - Lemm       vende HallownestSeal       \n",
      "  - Nailsmith  vende PureNail             \n",
      "  - Nailsmith  vende SharpenedNail        \n",
      "  - Nailsmith  vende ChanneledNail        \n",
      "  - Nailsmith  vende CoiledNail           \n",
      "  - Salubra    vende LifebloodHeart       \n",
      "  - Salubra    vende ShamanStone          \n",
      "  - Salubra    vende QuickFocus           \n",
      "  - Salubra    vende SteadyBody           \n",
      "  - Seer       vende DeepFocus            \n",
      "  - Seer       vende Dashmaster           \n",
      "  - Seer       vende DreamWielder         \n",
      "  - Seer       vende Grubsong             \n",
      "  - Sly        vende LanternDelicateFlower\n",
      "  - Sly        vende Longnail             \n",
      "  - Sly        vende HeavyBlow            \n",
      "  - Sly        vende RancidEgg            \n",
      "  - Sly        vende Sprintmaster         \n",
      "  - Sly        vende LifebloodCore        \n",
      "  - Sly        vende StalwartShell        \n",
      "  - Sly        vende GatheringSwarm       \n"
     ]
    }
   ],
   "source": [
    "# 4. CONSTRUCT: Criar um sub-grafo de mercadores e o que eles vendem\n",
    "q4 = \"\"\"\n",
    "CONSTRUCT { ?merchant hk:vende ?item . }\n",
    "WHERE { ?merchant hk:vende ?item . }\n",
    "\"\"\"\n",
    "print(\"\\n4. SPARQL CONSTRUCT: Sub-grafo de mercadores criado. (ordenado)\")\n",
    "sub_graph = g.query(q4)\n",
    "sub_graph = sorted(sub_graph, key=lambda tripla : tripla[0])\n",
    "\n",
    "for stmt in sub_graph:\n",
    "    sujeito = stmt[0].split('#')[-1]\n",
    "    objeto = stmt[2].split('#')[-1]\n",
    "    \n",
    "    # E passamos as variáveis de tamanho entre as chaves extras\n",
    "    print(f\"  - {sujeito:<{10}} vende {objeto:<{21}}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "ee5027a2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "5. SPARQL UPDATE (INSERT): Myla adicionada ao grafo.\n",
      "\n",
      " Tudo sobre Myla:\n",
      "  - nome -> Myla\n",
      "  - habitaEm -> ForgottenCrossroads\n",
      "  - type -> NPC\n"
     ]
    }
   ],
   "source": [
    "# 5. UPDATE - INSERT: Adicionar um novo personagem 'Myla'\n",
    "update_insert = \"\"\"\n",
    "PREFIX hk: <http://example.org/hollowknight#>\n",
    "INSERT DATA {\n",
    "    hk:Myla rdf:type hk:NPC ;\n",
    "            hk:nome \"Myla\" ;\n",
    "            hk:habitaEm hk:ForgottenCrossroads .\n",
    "}\n",
    "\"\"\"\n",
    "g.update(update_insert)\n",
    "print(\"\\n5. SPARQL UPDATE (INSERT): Myla adicionada ao grafo.\")\n",
    "\n",
    "# Mostrando as caracteristicas dela\n",
    "print(\"\\n Tudo sobre Myla:\")\n",
    "for s, p, o in g.triples((HK.Myla, None, None)):\n",
    "    print(f\"  - {p.split('#')[-1]} -> {o.split('#')[-1] if '#' in o else o}\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "6. SPARQL UPDATE (DELETE): Tiktik removido do grafo.\n",
      "\n",
      " Verificando se Tiktik foi removido:\n"
     ]
    }
   ],
   "source": [
    "# 6. UPDATE - DELETE: Remover 'Tiktik' do grafo\n",
    "update_delete = \"\"\"\n",
    "PREFIX hk: <http://example.org/hollowknight#>\n",
    "DELETE WHERE {\n",
    "    hk:Tiktik ?p ?o .\n",
    "}\n",
    "\"\"\"\n",
    "g.update(update_delete)\n",
    "print(\"\\n6. SPARQL UPDATE (DELETE): Tiktik removido do grafo.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "7. SPARQL UPDATE (DELETE/INSERT): Elderbug movido para Greenpath.\n"
     ]
    }
   ],
   "source": [
    "# 7. UPDATE - DELETE/INSERT: Mover Elderbug para Greenpath\n",
    "update_move = \"\"\"\n",
    "PREFIX hk: <http://example.org/hollowknight#>\n",
    "DELETE { hk:Elderbug hk:habitaEm hk:Dirtmouth . }\n",
    "INSERT { hk:Elderbug hk:habitaEm hk:Greenpath . }\n",
    "WHERE  { hk:Elderbug hk:habitaEm hk:Dirtmouth . }\n",
    "\"\"\"\n",
    "g.update(update_move)\n",
    "print(\"\\n7. SPARQL UPDATE (DELETE/INSERT): Elderbug movido para Greenpath.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "8. SPARQL SELECT (Agregação): Total de Bosses\n",
      "  - Total: 26\n"
     ]
    }
   ],
   "source": [
    "# 8. SELECT (Agregação): Contar o total de bosses\n",
    "q8 = \"\"\"\n",
    "SELECT (COUNT(?boss) AS ?totalBosses) WHERE {\n",
    "    ?boss rdf:type hk:Boss .\n",
    "}\n",
    "\"\"\"\n",
    "print(\"\\n8. SPARQL SELECT (Agregação): Total de Bosses\")\n",
    "for row in g.query(q8):\n",
    "    print(f\"  - Total: {row.totalBosses}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv-1 (3.12.3)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
